const Router = require('koa-router')
const router = new Router()
router.post('/post',(ctx)=>{
    //拿到post请求的参数
    
    console.log(ctx.request.body)

    ctx.body = [
        {
            id:1,
            name:'张三'
        },
        {
            id:2,
            name:'李四'
        }
    ]

})
router.get('/get',(ctx)=>{
    console.log('get')
    ctx.body = ['管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅','管海军好帅']
})
module.exports = router